In [450]:
import unicodecsv
import pandas as pd
#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [451]:
user = read_csv('../data_20180120/customer.csv')

In [452]:
users = pd.DataFrame(user)
users[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,"2,083",ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
1,"2,102",ทดสอบ002,N,1900036840,,,,,,,,,,,,,
2,"2,223",Ping,N,1900036887,,,,,,,,,,,,,
3,"2,224",มาศสุภา,N,1900036888,,,,,,,,,,,,,
4,"2,284",Tanate,N,1900036922,,,,,,,,,,,,,

In [453]:
len(users)

36212

In [454]:
import locale
locale.setlocale(locale.LC_ALL, '') 

neww_users = users[:]

neww_users['CUSTOMER_ID'] = users['CUSTOMER_ID'].apply(locale.atoi)
neww_users_birth = neww_users[neww_users['DATE_OF_BIRTH'].notnull() & (neww_users['DATE_OF_BIRTH'] != "")]

neww_users_birth[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,2083,ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
13,2390,ภิญญามาศ,N,1100700539,770/73,10250,01010000000,กรุงเทพมหานคร,ถ.พัฒนาการ,01011230000,แขวงสวนหลวง,01011230120,เขตสวนหลวง,HOUSE,หมู่บ้านพาทิโอ,,1986-8-11
16,2406,พัชรา,N,1100698992,ห้อง55/56,10150,01010000000,กรุงเทพมหานคร,ราชพฤกษ์,01010870000,แขวงบางค้อ,01010870055,เขตจอมทอง,CONDOMINIUM,คอนโดIdeo วุฒากาศ,บล.หลักทรัพย์ฟิลลิป,1983-10-10
21,2412,ณภัทร,N,1100463792,164/316,11110,01240000000,จ.นนทบุรี,บางกรวย-ไทรน้อย,01244250000,ต.พิมลราช,01244254131,อ.บางบัวทอง,HOUSE,,,1989-10-25
22,2413,ทวีศักดิ์,N,1100694276,320/144 (ตึก A ห้อง 1009),11000,01240000000,จ.นนทบุรี,รัตนาธิเบศร์,01246240000,ต.บางกระสอ,01246243042,อ.เมืองนนทบุรี,CONDOMINIUM,ลุมพินีพาร์ค รัตนาธิเบศร์-งามวงศ์วาน,,1982-6-4

# customer ที่ไม่ได้filter

In [ ]:
cutomer_no_filter = neww_users[neww_users['DATE_OF_BIRTH'].notnull() & (neww_users['DATE_OF_BIRTH'] != "")]

In [548]:
df_age_null = users['DATE_OF_BIRTH']
df_age_null[:10]

0    1988-10-30
1
2
3
4
5
6
7
8
9
Name: DATE_OF_BIRTH, dtype: object

In [583]:
date_null = pd.DataFrame(df_age_null)
date_null[:4]

  DATE_OF_BIRTH
0    1988-10-30
1
2
3

In [585]:
from datetime import datetime

def bd_to_age(bd_str):
    bd_str = datetime_ob
    if bd_str ==isnull:
        datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
        now = datetime.now().date()
        delta = (now - datetime_ob)
        number_of_days = delta.days
        number_of_years = number_of_days/365
        return number_of_years
    else

In [559]:
date_null('1988-10-30')

29.306849315068494

In [555]:
age_null = users['DATE_OF_BIRTH'].apply(date_null)
age_null[:5]

ValueError: time data '' does not match format '%Y-%m-%d'

In [455]:
customer = neww_users_birth['CUSTOMER_ID']
address = neww_users_birth['ADDRESS_POSTAL_CODE']
date = neww_users_birth['DATE_OF_BIRTH']


new_users = pd.concat([customer,address,date], axis=1)
new_users[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE DATE_OF_BIRTH
0          2083               20170    1988-10-30
13         2390               10250     1986-8-11
16         2406               10150    1983-10-10
21         2412               11110    1989-10-25
22         2413               11000      1982-6-4

In [456]:
address_only = users['ADDRESS_POSTAL_CODE']
address_only[:5]

0    20170
1
2
3
4
Name: ADDRESS_POSTAL_CODE, dtype: object

In [457]:
df_address = pd.DataFrame(address_only ,columns=['ADDRESS_POSTAL_CODE'])
df_address[:5]

  ADDRESS_POSTAL_CODE
0               20170
1
2
3
4

# check null

In [458]:
pd.isnull(df_address).sum()>0

ADDRESS_POSTAL_CODE    False
dtype: bool

# เอา empty ออกจาก address

In [459]:
address_notnull.convert_objects(convert_numeric=True)[:4]

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

   ADDRESS_POSTAL_CODE
0              20170.0
1                  NaN
2                  NaN
3                  NaN

In [460]:
address2 = address_notnull.convert_objects(convert_numeric=True).dropna()
address2[:5]

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

    ADDRESS_POSTAL_CODE
0               20170.0
9               11120.0
10              10210.0
13              10250.0
16              10150.0

# รวมแถว customer กับ address

In [461]:
id_address = pd.concat([customer,address2], axis=1)
id_address[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0        2083.0              20170.0
9           NaN              11120.0
10          NaN              10210.0
13       2390.0              10250.0
16       2406.0              10150.0

In [462]:
id_notnull = id_address[id_address['CUSTOMER_ID'].notnull()&(id_notnull['ADDRESS_POSTAL_CODE'].notnull())]
id_notnull[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0        2083.0              20170.0
13       2390.0              10250.0
16       2406.0              10150.0
21       2412.0              11110.0
22       2413.0              11000.0

In [463]:
pd.isnull(id_notnull).sum()>0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
dtype: bool

In [465]:
id_notnull.to_csv('../data_clean/customer_address.csv', index = False)

# Age

In [466]:
len(id_notnull)

10276

In [467]:
new_users.dtypes

CUSTOMER_ID             int64
ADDRESS_POSTAL_CODE    object
DATE_OF_BIRTH          object
dtype: object

In [520]:
new_users[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE DATE_OF_BIRTH
0          2083               20170    1988-10-30
13         2390               10250     1986-8-11
16         2406               10150    1983-10-10
21         2412               11110    1989-10-25
22         2413               11000      1982-6-4

# Convert date to age

In [334]:
y_m_d = new_users['DATE_OF_BIRTH']
y_m_d[:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

In [335]:

from datetime import datetime
now = datetime.now()
now

datetime.datetime(2018, 2, 12, 14, 50, 55, 380871)

In [336]:
 y = now.year
y

2018

In [337]:
 y- int('1988')

30

In [338]:
from datetime import datetime

def bd_to_age(bd_str):
    datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
    now = datetime.now().date()
    delta = (now - datetime_ob)
    number_of_days = delta.days
    number_of_years = number_of_days/365
    return number_of_years

In [339]:
bd_to_age('1988-10-30')

29.306849315068494

# Age

In [534]:
 age_dirt = new_users['DATE_OF_BIRTH'].apply(bd_to_age)
age_dirt[:5]

0     29.306849
13    31.528767
16    34.367123
21    28.320548
22    35.717808
Name: DATE_OF_BIRTH, dtype: float64

In [341]:
len(age_dirt)

10594

In [ ]:
users_all = pd.concat([,age_dirt], axis=1)

# รวมแถวที่มี id&address&date

In [363]:
users_all = pd.concat([address,age_dirt], axis=1)
users_all[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0        2083.0              20170.0      29.306849
13       2390.0              10250.0      31.528767
16       2406.0              10150.0      34.367123
21       2412.0              11110.0      28.320548
22       2413.0              11000.0      35.717808

In [364]:
pd.isnull(users_all).sum() > 0

CUSTOMER_ID             True
ADDRESS_POSTAL_CODE     True
DATE_OF_BIRTH          False
dtype: bool

In [367]:
customer_notnull = users_all[users_all['CUSTOMER_ID'].notnull()& (users_all['ADDRESS_POSTAL_CODE'].notnull())]
customer_notnull[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0        2083.0              20170.0      29.306849
13       2390.0              10250.0      31.528767
16       2406.0              10150.0      34.367123
21       2412.0              11110.0      28.320548
22       2413.0              11000.0      35.717808

In [368]:
pd.isnull(customer_notnull).sum() > 0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
DATE_OF_BIRTH          False
dtype: bool

In [371]:
customer_notnull['Age_dirt'] = age_dirt

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [372]:
customer_notnull[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE  DATE_OF_BIRTH   Age_dirt
0        2083.0              20170.0      29.306849  29.306849
13       2390.0              10250.0      31.528767  31.528767
16       2406.0              10150.0      34.367123  34.367123
21       2412.0              11110.0      28.320548  28.320548
22       2413.0              11000.0      35.717808  35.717808

# ลบแถวDATE_OF_BIRTH

In [374]:
del customer_notnull['DATE_OF_BIRTH']

customer_notnull[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE   Age_dirt
0        2083.0              20170.0  29.306849
13       2390.0              10250.0  31.528767
16       2406.0              10150.0  34.367123
21       2412.0              11110.0  28.320548
22       2413.0              11000.0  35.717808

In [375]:
len(users_all)

10594

# check max of age

In [376]:
users_all.loc[users_all['Age_dirt'].idxmax()]

CUSTOMER_ID            55624.000000
ADDRESS_POSTAL_CODE    11110.000000
DATE_OF_BIRTH           2017.454795
Age_dirt                2017.454795
Name: 9726, dtype: float64

# กำหนดเอาค่าอายุระหว่าง0 ถึง 130ปี

In [377]:
users_clean = customer_notnull[customer_notnull['CUSTOMER_ID'].notnull() & (customer_notnull['ADDRESS_POSTAL_CODE'].notnull() )& (customer_notnull['Age_dirt'] <= 130) &(customer_notnull['Age_dirt'] >= 0)]

users_clean[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE   Age_dirt
0        2083.0              20170.0  29.306849
13       2390.0              10250.0  31.528767
16       2406.0              10150.0  34.367123
21       2412.0              11110.0  28.320548
22       2413.0              11000.0  35.717808

In [378]:
users_all.dtypes

CUSTOMER_ID            float64
ADDRESS_POSTAL_CODE    float64
DATE_OF_BIRTH          float64
Age_dirt               float64
dtype: object

# ดังนั้นข้อมูลที่cleanทั้งหมดมี 10,225

In [379]:
len(users_clean )

10225

In [382]:
len(users_all)

10594

In [383]:
users_clean.dtypes

CUSTOMER_ID            float64
ADDRESS_POSTAL_CODE    float64
Age_dirt               float64
dtype: object

In [384]:
pd.isnull(users_clean).sum() > 0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
Age_dirt               False
dtype: bool

In [387]:
age_array=users_clean.as_matrix(columns=users_clean.columns[2:])  
age_array

array([[ 29.30684932],
       [ 31.52876712],
       [ 34.36712329],
       ...,
       [ 48.09315068],
       [ 29.90958904],
       [ 30.08219178]])

# check max min

In [388]:
users_clean.loc[users_clean['Age_dirt'].idxmax()]

CUSTOMER_ID            127807.000000
ADDRESS_POSTAL_CODE     22170.000000
Age_dirt                  129.205479
Name: 22584, dtype: float64

In [389]:
users_clean.loc[users_clean['Age_dirt'].idxmin()]

CUSTOMER_ID            186282.000000
ADDRESS_POSTAL_CODE     10110.000000
Age_dirt                    0.115068
Name: 31810, dtype: float64

# mean

In [390]:
import numpy as np

mean= np.mean(age_array)
mean

34.412184747295449

In [391]:
sd = np.std(age_array)
sd

9.9789663236664445